# import cv2
#
# img = cv2.imread("test.jpg") # # подключаем картинку  в программу указывая ее путь
# # print(img .shape)  # # выводим каждый пиксель в ввиде масива  кодировки цветов OpenCV работает BGR нам привычней видеть кодировку RBG
# # # img = cv2.resize(img,(500,500)) # # Меняем размер картинки
# # print(img .shape)
# cv2.imshow('Result', img) # # Выводим саму картинку( 'Result' -это названия открывающегося окна,img - это наша картинка
# cv2.waitKey(0) # # Задаем задержку на закрытие окна 0 - не закроется (1000 - закроется через 1000 мили секунд)
